'''
Исполнитель Калькулятор преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
1. Прибавь 1
2. Прибавь 3
3. Умножь на 2
Первая команда увеличивает число на экране на 1, вторая увеличивает его на 3, третья – умножает на 2.
Программа для исполнителя – это последовательность команд. Сколько существует программ, которые преобразуют исходное число 3 в число 60,
и при этом траектория вычислений содержит число 20 и не содержит чисел 30 и 40. Также программа не должна содержать двух команд «Умножь на 2» подряд.
'''


